MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256D.atdf
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph1" name="RPIN" name-in-module="RPIN" offset="0x1f80fa04" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01423" name="RPOUT" version="">
            <instance name="RPOUT">
               <register-group address-space="periph1" name="RPOUT" name-in-module="RPOUT" offset="0x1f80fb00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph0" name="RTCC" name-in-module="RTCC" offset="0x1f800200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph0" name="SPI" name-in-module="SPI" offset="0x1f805800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph0" name="TMR1" name-in-module="TMR1" offset="0x1f800600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00745" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph0" name="TMR" name-in-module="TMR" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph0" name="UART" name-in-module="UART" offset="0x1f806000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01195" name="USB" version="">
            <instance name="USB">
               <register-group address-space="periph2" name="USB" name-in-module="USB" offset="0x1f885040" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph1" name="WDT" name-in-module="WDT" offset="0x1f80f600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer" irq-caption="Core Timer" index="0" irq-index="0" name="CORE_TIMER" irq-name="CORE_TIMER"/>
         <interrupt caption="Core Software 0" irq-caption="Core Software 0" index="1" irq-index="1" name="CORE_SOFTWARE_0" irq-name="CORE_SOFTWARE_0"/>
         <interrupt caption="Core Software 1" irq-caption="Core Software 1" index="2" irq-index="2" name="CORE_SOFTWARE_1" irq-name="CORE_SOFTWARE_1"/>
         <interrupt caption="Ext INT 0" irq-caption="Ext INT 0" index="3" irq-index="3" name="EXTERNAL_0" irq-name="EXTERNAL_0"/>
         <interrupt caption="Timer1" irq-caption="Timer1" index="4" irq-index="4" name="TIMER_1" irq-name="TIMER_1"/>
         <interrupt caption="Input Capture 1" irq-caption="Input Capture 1 Error" index="5" irq-index="5" name="INPUT_CAPTURE_1" irq-name="INPUT_CAPTURE_ERROR_1" />
         <interrupt caption="Input Capture 1" irq-caption="Input Capture 1" index="5" irq-index="6" name="INPUT_CAPTURE_1" irq-name="INPUT_CAPTURE_1"/>
         <interrupt caption="Output Compare 1" irq-caption="Output Compare 1" index="6" irq-index="7" name="OUTPUT_COMPARE_1" irq-name="OUTPUT_COMPARE_1"/>
         <interrupt caption="Ext INT 1" irq-caption="Ext INT 1" index="7" irq-index="8" name="EXTERNAL_1" irq-name="EXTERNAL_1"/>
         <interrupt caption="Timer2" irq-caption="Timer2" index="8" irq-index="9" name="TIMER_2" irq-name="TIMER_2"/>
         <interrupt caption="Input Capture 2" irq-caption="Input Capture 2 Error" index="9" irq-index="10" name="INPUT_CAPTURE_2" irq-name="INPUT_CAPTURE_ERROR_2" />
         <interrupt caption="Input Capture 2" irq-caption="Input Capture 2" index="9" irq-index="11" name="INPUT_CAPTURE_2" irq-name="INPUT_CAPTURE_2"/>
         <interrupt caption="Output Compare 2" irq-caption="Output Compare 2" index="10" irq-index="12" name="OUTPUT_COMPARE_2" irq-name="OUTPUT_COMPARE_2"/>
         <interrupt caption="Ext INT 2" irq-caption="Ext INT 2" index="11" irq-index="13" name="EXTERNAL_2" irq-name="EXTERNAL_2"/>
         <interrupt caption="Timer3" irq-caption="Timer3" index="12" irq-index="14" name="TIMER_3" irq-name="TIMER_3"/>
         <interrupt caption="Input Capture 3" irq-caption="Input Capture 3 Error" index="13" irq-index="15" name="INPUT_CAPTURE_3" irq-name="INPUT_CAPTURE_ERROR_3" />
         <interrupt caption="Input Capture 3" irq-caption="Input Capture 3" index="13" irq-index="16" name="INPUT_CAPTURE_3" irq-name="INPUT_CAPTURE_3"/>
         <interrupt caption="Output Compare 3" irq-caption="Output Compare 3" index="14" irq-index="17" name="OUTPUT_COMPARE_3" irq-name="OUTPUT_COMPARE_3"/>
         <interrupt caption="Ext INT 3" irq-caption="Ext INT 3" index="15" irq-index="18" name="EXTERNAL_3" irq-name="EXTERNAL_3"/>
         <interrupt caption="Timer4" irq-caption="Timer4" index="16" irq-index="19" name="TIMER_4" irq-name="TIMER_4"/>
         <interrupt caption="Input Capture 4" irq-caption="Input Capture 4 Error" index="17" irq-index="20" name="INPUT_CAPTURE_4" irq-name="INPUT_CAPTURE_ERROR_4" />
         <interrupt caption="Input Capture 4" irq-caption="Input Capture 4" index="17" irq-index="21" name="INPUT_CAPTURE_4" irq-name="INPUT_CAPTURE_4"/>
         <interrupt caption="Output Compare 4" irq-caption="Output Compare 4" index="18" irq-index="22" name="OUTPUT_COMPARE_4" irq-name="OUTPUT_COMPARE_4"/>
         <interrupt caption="Ext INT 4" irq-caption="Ext INT 4" index="19" irq-index="23" name="EXTERNAL_4" irq-name="EXTERNAL_4"/>
         <interrupt caption="Timer5" irq-caption="Timer5" index="20" irq-index="24" name="TIMER_5" irq-name="TIMER_5"/>
         <interrupt caption="Input Capture 5" irq-caption="Input Capture 5 Error" index="21" irq-index="25" name="INPUT_CAPTURE_5" irq-name="INPUT_CAPTURE_ERROR_5" />
         <interrupt caption="Input Capture 5" irq-caption="Input Capture 5" index="21" irq-index="26" name="INPUT_CAPTURE_5" irq-name="INPUT_CAPTURE_5"/>
         <interrupt caption="Output Compare 5" irq-caption="Output Compare 5" index="22" irq-index="27" name="OUTPUT_COMPARE_5" irq-name="OUTPUT_COMPARE_5"/>
         <interrupt caption="ADC" irq-caption="ADC1 Convert Done" index="23" irq-index="28" name="ADC" irq-name="ADC"/>
         <interrupt caption="Fail Safe Clock Monitor" irq-caption="Fail Safe Clock Monitor" index="24" irq-index="29" name="FAIL_SAFE_MONITOR" irq-name="FAIL_SAFE_MONITOR"/>
         <interrupt caption="Real Time Clock Calendar" irq-caption="Real Time Clock Calendar" index="25" irq-index="30" name="RTCC" irq-name="RTCC"/>
         <interrupt caption="Flash Control Event" irq-caption="Flash Control Event" index="26" irq-index="31" name="FCE" irq-name="FLASH_CONTROL"/>
         <interrupt caption="Comparator 1" irq-caption="Comparator 1" index="27" irq-index="32" name="COMPARATOR_1" irq-name="COMPARATOR_1"/>
         <interrupt caption="Comparator 2" irq-caption="Comparator 2" index="28" irq-index="33" name="COMPARATOR_2" irq-name="COMPARATOR_2"/>
         <interrupt caption="Comparator 3" irq-caption="Comparator 3" index="29" irq-index="34" name="COMPARATOR_3" irq-name="COMPARATOR_3"/>
         <interrupt caption="USB Module 1" irq-caption="USB Module 1"  index="30" irq-index="35" name="USB_1" irq-name="USB"/>
         <interrupt caption="SPI 1" irq-caption="SPI1 Fault" index="31" irq-index="36" name="SPI_1" irq-name="SPI1_ERR"/>
         <interrupt caption="SPI 1" irq-caption="SPI1 RX" index="31" irq-index="37" name="SPI_1" irq-name="SPI1_RX"/>
         <interrupt caption="SPI 1" irq-caption="SPI1 TX" index="31" irq-index="38" name="SPI_1" irq-name="SPI1_TX"/>
         <interrupt caption="UART 1" irq-caption="UART1 Error" index="32" irq-index="39" name="UART_1" irq-name="UART1_ERR"/>
         <interrupt caption="UART 1" irq-caption="UART1 RX" index="32" irq-index="40" name="UART_1" irq-name="UART1_RX"/>
         <interrupt caption="UART 1" irq-caption="UART1 TX" index="32" irq-index="41" name="UART_1" irq-name="UART1_TX"/>
         <interrupt caption="I2C 1" irq-caption="I2C1 Bus Collision Event" index="33" irq-index="42" name="I2C_1" irq-name="I2C1_BUS"/>
         <interrupt caption="I2C 1" irq-caption="I2C1 Slave Event" index="33" irq-index="43" name="I2C_1" irq-name="I2C1_SLAVE"/>
         <interrupt caption="I2C 1" irq-caption="I2C1 Master Event" index="33" irq-index="44" name="I2C_1" irq-name="I2C1_MASTER"/>
         <interrupt caption="Change Notice" irq-caption="PORTA Input Change Interrupt" index="34" irq-index="45" name="CHANGE_NOTICE" irq-name="CHANGE_NOTICE_A"/>
         <interrupt caption="Change Notice" irq-caption="PORTB Input Change Interrupt" index="34" irq-index="46" name="CHANGE_NOTICE" irq-name="CHANGE_NOTICE_B"/>
         <interrupt caption="Change Notice" irq-caption="PORTC Input Change Interrupt" index="34" irq-index="47" name="CHANGE_NOTICE" irq-name="CHANGE_NOTICE_C"/>
         <interrupt caption="PMP" irq-caption="Parallel Master Port" index="35" irq-index="48" name="PMP" irq-name="PMP"/>
         <interrupt caption="PMP" irq-caption="PMP Error" index="35" irq-index="49" name="PMP" irq-name="PMP_ERROR"/>
         <interrupt caption="SPI 2" irq-caption="SPI2 Fault" index="36" irq-index="50" name="SPI_2" irq-name="SPI2_ERR"/>
         <interrupt caption="SPI 2" irq-caption="SPI2 RX" index="36" irq-index="51" name="SPI_2" irq-name="SPI2_RX"/>
         <interrupt caption="SPI 2" irq-caption="SPI2 TX" index="36" irq-index="52" name="SPI_2" irq-name="SPI2_TX"/>
         <interrupt caption="UART 2" irq-caption="UART2 Error" index="37" irq-index="53" name="UART_2" irq-name="UART2_ERR"/>
         <interrupt caption="UART 2" irq-caption="UART2 RX" index="37" irq-index="54" name="UART_2" irq-name="UART2_RX"/>
         <interrupt caption="UART 2" irq-caption="UART2 TX" index="37" irq-index="55" name="UART_2" irq-name="UART2_TX"/>
         <interrupt caption="I2C 2" irq-caption="I2C2 Bus Collision Event" index="38" irq-index="56" name="I2C_2" irq-name="I2C2_BUS"/>
         <interrupt caption="I2C 2" irq-caption="I2C2 Slave Event" index="38" irq-index="57" name="I2C_2" irq-name="I2C2_SLAVE"/>
         <interrupt caption="I2C 2" irq-caption="I2C2 Master Event" index="38" irq-index="58" name="I2C_2" irq-name="I2C2_MASTER"/>
         <interrupt caption="CTMU Event" irq-caption="CTMU Event" index="39" irq-index="59" name="CTMU" irq-name="CTMU"/>
         <interrupt caption="DMA Channel 0" irq-caption="DMA Channel 0" index="40" irq-index="60" name="DMA_0" irq-name="DMA0"/>
         <interrupt caption="DMA Channel 1" irq-caption="DMA Channel 1" index="41" irq-index="61" name="DMA_1" irq-name="DMA1"/>
         <interrupt caption="DMA Channel 2" irq-caption="DMA Channel 2" index="42" irq-index="62" name="DMA_2" irq-name="DMA2"/>
         <interrupt caption="DMA Channel 3" irq-caption="DMA Channel 3" index="43" irq-index="63" name="DMA_3" irq-name="DMA3"/>
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="00000" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" name="DEVCFG3" initval="0xFF3FFFFF">
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
            <bitfield caption="Alternate I/O Select for I2C1 bit" mask="0x400000" name="AI2C1" values="DEVCFG3__AI2C1" />
            <bitfield caption="Alternate I/O Select for I2C2 bit" mask="0x800000" name="AI2C2" values="DEVCFG3__AI2C2" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
            <bitfield caption="USB USBID Selection bit" mask="0x40000000" name="FUSBIDIO" values="DEVCFG3__FUSBIDIO" />
         </register>
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xBFF8FAB9">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV" />
            <bitfield caption="PLL Multiplier bits" mask="0x70" name="FPLLMUL" values="DEVCFG2__FPLLMUL" />
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK" />
            <bitfield caption="USB PLL Input Divider bits" mask="0x700" name="UPLLIDIV" values="DEVCFG2__UPLLIDIV" />
            <bitfield caption="USB PLL Enable bit" mask="0x8000" name="UPLLEN" values="DEVCFG2__UPLLEN" />
            <bitfield caption="Default PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV" />
            <bitfield caption="Brown-Out Reset (BOR) Enable bit" mask="0x100000" name="BOREN" values="DEVCFG2__BOREN" />
            <bitfield caption="Deep Sleep BOR Enable bit" mask="0x800000" name="DSBOREN" values="DEVCFG2__DSBOREN" />
            <bitfield caption="Deep Sleep Watchdog Timer Postscale Select bits" mask="0x1f000000" name="DSWDTPS" values="DEVCFG2__DSWDTPS" />
            <bitfield caption="Deep Sleep Watchdog Timer Reference Clock Select bit" mask="0x20000000" name="DSWDTOSC" values="DEVCFG2__DSWDTOSC" />
            <bitfield caption="Deep Sleep Watchdog Timer Enable bit" mask="0x40000000" name="DSWDTEN" values="DEVCFG2__DSWDTEN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x80000000" name="FDSEN" values="DEVCFG2__FDSEN" />
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0xFF74DFD9">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x20" name="FSOSCEN" values="DEVCFG1__FSOSCEN" />
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO" />
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD" />
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC" />
            <bitfield caption="Peripheral Bus Clock Divisor Default Value bits" mask="0x3000" name="FPBDIV" values="DEVCFG1__FPBDIV" />
            <bitfield caption="Clock Switching and Monitor Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM" />
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS" />
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN" />
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ" />
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0xFFFFFFFB">
            <bitfield caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG" />
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN" />
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL" />
            <bitfield caption="Program Flash Write-Protect bits" mask="0xff000" name="PWP" values="DEVCFG0__PWP" />
            <bitfield caption="Soft Master Clear Enable bit" mask="0x800000" name="SMCLR" values="DEVCFG0__SMCLR" />
            <bitfield caption="Boot Flash Write-Protect bit" mask="0x1000000" name="BWP" values="DEVCFG0__BWP" />
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCFG0__CP" />
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name="" />
      </value-group>
      <value-group caption="Alternate I/O Select for I2C1 bit" name="DEVCFG3__AI2C1">
         <value caption="I2C1 uses the ASDA1/ASCL1 pins" name="ON" value="0x1" />
         <value caption="I2C1 uses the SDA1/SCL1 pins" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Alternate I/O Select for I2C2 bit" name="DEVCFG3__AI2C2">
         <value caption="I2C2 uses the ASDA2/ASCL2 pins" name="ON" value="0x1" />
         <value caption="I2C2 uses the SDA2/SCL2 pins" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1" />
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="USB USBID Selection bit" name="DEVCFG3__FUSBIDIO">
         <value caption="USBID pin is controlled by the USB module" name="ON" value="0x1" />
         <value caption="USBID pin is controlled by the port function" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0" />
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="3x Divider" name="DIV_3" value="0x2" />
         <value caption="4x Divider" name="DIV_4" value="0x3" />
         <value caption="5x Divider" name="DIV_5" value="0x4" />
         <value caption="6x Divider" name="DIV_6" value="0x5" />
         <value caption="10x Divider" name="DIV_10" value="0x6" />
         <value caption="12x Divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="PLL Multiplier bits" name="DEVCFG2__FPLLMUL">
         <value caption="15x Multiplier" name="MUL_15" value="0x0" />
         <value caption="16x Multiplier" name="MUL_16" value="0x1" />
         <value caption="17x Multiplier" name="MUL_17" value="0x2" />
         <value caption="18x Multiplier" name="MUL_18" value="0x3" />
         <value caption="19x Multiplier" name="MUL_19" value="0x4" />
         <value caption="20x Multiplier" name="MUL_20" value="0x5" />
         <value caption="21x Multiplier" name="MUL_21" value="0x6" />
         <value caption="24x Multiplier" name="MUL_24" value="0x7" />
      </value-group>
