MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256D.atdf
      <value-group caption="System PLL Input Clock Select bit" name="DEVCFG2__FPLLICLK">
         <value caption="POSC is input to the System PLL" name="PLL_POSC" value="0x0" />
         <value caption="FRC is input to the System PLL" name="PLL_FRC" value="0x1" />
      </value-group>
      <value-group caption="USB PLL Input Divider bits" name="DEVCFG2__UPLLIDIV">
         <value caption="1x divider" name="DIV_1" value="0x0" />
         <value caption="2x divider" name="DIV_2" value="0x1" />
         <value caption="3x divider" name="DIV_3" value="0x2" />
         <value caption="4x divider" name="DIV_4" value="0x3" />
         <value caption="5x divider" name="DIV_5" value="0x4" />
         <value caption="6x divider" name="DIV_6" value="0x5" />
         <value caption="10x divider" name="DIV_10" value="0x6" />
         <value caption="12x divider" name="DIV_12" value="0x7" />
      </value-group>
      <value-group caption="USB PLL Enable bit" name="DEVCFG2__UPLLEN">
         <value caption="Enable USB PLL" name="ON" value="0x0" />
         <value caption="Disable and bypass USB PLL" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Default PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
      </value-group>
      <value-group caption="Brown-Out Reset (BOR) Enable bit" name="DEVCFG2__BOREN">
         <value caption="Disable BOR" name="OFF" value="0x0" />
         <value caption="Enable BOR in all modes except Deep Sleep mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep BOR Enable bit" name="DEVCFG2__DSBOREN">
         <value caption="Disable BOR during Deep Sleep mode, but remains enabled in other sleep modes" name="OFF" value="0x0" />
         <value caption="Enable BOR during Deep Sleep mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Postscale Select bits" name="DEVCFG2__DSWDTPS">
         <value caption="1:2^5" name="DSPS1" value="0x0" />
         <value caption="1:2^6" name="DSPS2" value="0x1" />
         <value caption="1:2^7" name="DSPS3" value="0x2" />
         <value caption="1:2^8" name="DSPS4" value="0x3" />
         <value caption="1:2^9" name="DSPS5" value="0x4" />
         <value caption="1:2^10" name="DSPS6" value="0x5" />
         <value caption="1:2^11" name="DSPS7" value="0x6" />
         <value caption="1:2^12" name="DSPS8" value="0x7" />
         <value caption="1:2^13" name="DSPS9" value="0x8" />
         <value caption="1:2^14" name="DSPS10" value="0x9" />
         <value caption="1:2^15" name="DSPS11" value="0xa" />
         <value caption="1:2^16" name="DSPS12" value="0xb" />
         <value caption="1:2^17" name="DSPS13" value="0xc" />
         <value caption="1:2^18" name="DSPS14" value="0xd" />
         <value caption="1:2^19" name="DSPS15" value="0xe" />
         <value caption="1:2^20" name="DSPS16" value="0xf" />
         <value caption="1:2^21" name="DSPS17" value="0x10" />
         <value caption="1:2^22" name="DSPS18" value="0x11" />
         <value caption="1:2^23" name="DSPS19" value="0x12" />
         <value caption="1:2^24" name="DSPS20" value="0x13" />
         <value caption="1:2^25" name="DSPS21" value="0x14" />
         <value caption="1:2^26" name="DSPS22" value="0x15" />
         <value caption="1:2^27" name="DSPS23" value="0x16" />
         <value caption="1:2^28" name="DSPS24" value="0x17" />
         <value caption="1:2^29" name="DSPS25" value="0x18" />
         <value caption="1:2^30" name="DSPS26" value="0x19" />
         <value caption="1:2^31" name="DSPS27" value="0x1a" />
         <value caption="1:2^32" name="DSPS28" value="0x1b" />
         <value caption="1:2^33" name="DSPS29" value="0x1c" />
         <value caption="1:2^34" name="DSPS30" value="0x1d" />
         <value caption="1:2^35" name="DSPS31" value="0x1e" />
         <value caption="1:2^36" name="DSPS32" value="0x1f" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Reference Clock Select bit" name="DEVCFG2__DSWDTOSC">
         <value caption="Select SOSC as DSWDT Reference Clock" name="SOSC" value="0x0" />
         <value caption="Select LPRC as DSWDT Reference clock" name="LPRC" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable bit" name="DEVCFG2__DSWDTEN">
         <value caption="Disable DSWDT during Deep Sleep Mode" name="OFF" value="0x0" />
         <value caption="Enable DSWDT during Deep Sleep Mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Enable bit" name="DEVCFG2__FDSEN">
         <value caption="Sleep mode is entered on a WAIT command" name="OFF" value="0x0" />
         <value caption="Deep Sleep mode is entered on a WAIT command" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Oscillator Selection bits" name="DEVCFG1__FNOSC">
         <value caption="Fast RC Osc (FRC)" name="FRC" value="0x0" />
         <value caption="System PLL" name="SPLL" value="0x1" />
         <value caption="Primary Osc (HS,EC, XT)" name="POSC" value="0x2" />
         <value caption="Low Power Secondary Osc (SOSC)" name="SOSC" value="0x4" />
         <value caption="Low Power RC Osc (LPRC)" name="LPRC" value="0x5" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="DEVCFG1__FSOSCEN">
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Internal External Switchover bit" name="DEVCFG1__IESO">
         <value caption="Internal External Switchover mode is disabled (Two-Speed Start-up is disabled)" name="OFF" value="0x0" />
         <value caption="Internal External Switchover mode is enabled (Two-Speed Start-up is enabled)" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="DEVCFG1__POSCMOD">
         <value caption="External clock mode" name="EC" value="0x0" />
         <value caption="XT osc mode" name="XT" value="0x1" />
         <value caption="HS osc mode" name="HS" value="0x2" />
         <value caption="Primary osc disabled" name="OFF" value="0x3" />
      </value-group>
      <value-group caption="CLKO Enable Configuration bit" name="DEVCFG1__OSCIOFNC">
         <value caption="Disabled" name="OFF" value="0x1" />
         <value caption="Enabled" name="ON" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Default Value bits" name="DEVCFG1__FPBDIV">
         <value caption="Pb_Clk is Sys_Clk/1" name="DIV_1" value="0x0" />
         <value caption="Pb_Clk is Sys_Clk/2" name="DIV_2" value="0x1" />
         <value caption="Pb_Clk is Sys_Clk/4" name="DIV_4" value="0x2" />
         <value caption="Pb_Clk is Sys_Clk/8" name="DIV_8" value="0x3" />
      </value-group>
      <value-group caption="Clock Switching and Monitor Selection Configuration bits" name="DEVCFG1__FCKSM">
         <value caption="Clock Switch Enable, FSCM Enabled" name="CSECME" value="0x0" />
         <value caption="Clock Switch Enable, FSCM Disabled" name="CSECMD" value="0x1" />
         <value caption="Clock Switch Disable, FSCM Disabled" name="CSDCMD" value="0x3" />
      </value-group>
      <value-group caption="Watchdog Timer Postscale Select bits" name="DEVCFG1__WDTPS">
         <value caption="1:1" name="PS1" value="0x0" />
         <value caption="1:2" name="PS2" value="0x1" />
         <value caption="1:4" name="PS4" value="0x2" />
         <value caption="1:8" name="PS8" value="0x3" />
         <value caption="1:16" name="PS16" value="0x4" />
         <value caption="1:32" name="PS32" value="0x5" />
         <value caption="1:64" name="PS64" value="0x6" />
         <value caption="1:128" name="PS128" value="0x7" />
         <value caption="1:256" name="PS256" value="0x8" />
         <value caption="1:512" name="PS512" value="0x9" />
         <value caption="1:1024" name="PS1024" value="0xa" />
         <value caption="1:2048" name="PS2048" value="0xb" />
         <value caption="1:4096" name="PS4096" value="0xc" />
         <value caption="1:8192" name="PS8192" value="0xd" />
         <value caption="1:16384" name="PS16384" value="0xe" />
         <value caption="1:32768" name="PS32768" value="0xf" />
         <value caption="1:65536" name="PS65536" value="0x10" />
         <value caption="1:131072" name="PS131072" value="0x11" />
         <value caption="1:262144" name="PS262144" value="0x12" />
         <value caption="1:524288" name="PS524288" value="0x13" />
         <value caption="1:1048576" name="PS1048576" value="0x14" />
      </value-group>
      <value-group caption="Watchdog Timer Stop During Flash Programming bit" name="DEVCFG1__WDTSPGM">
         <value caption="Watchdog Timer stops during Flash programming" name="ON" value="0x1" />
         <value caption="Watchdog Timer runs during Flash programming" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="DEVCFG1__WINDIS">
         <value caption="Watchdog Timer is in Window Mode" name="ON" value="0x0" />
         <value caption="Watchdog Timer is in Non-Window Mode" name="OFF" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="DEVCFG1__FWDTEN">
         <value caption="WDT Disabled (SWDTEN Bit Controls)" name="OFF" value="0x0" />
         <value caption="WDT Enabled" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="DEVCFG1__FWDTWINSZ">
         <value caption="Window Size is 75%" name="WINSZ_75" value="0x0" />
         <value caption="Window Size is 50%" name="WINSZ_50" value="0x1" />
         <value caption="Window Size is 37.5%" name="WINSZ_37" value="0x2" />
         <value caption="Window Size is 25%" name="WINSZ_25" value="0x3" />
      </value-group>
      <value-group caption="Background Debugger Enable bits (forced to 11 if code-protect is enabled)" name="DEVCFG0__DEBUG">
         <value caption="Debugger is Enabled" name="ON" value="0x0" />
         <value caption="Debugger is Disabled" name="OFF" value="0x3" />
      </value-group>
