MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256D.atdf
      <value-group caption="Auto-Sample Time bits" name="AD1CON3__SAMC">
         <value caption="31 TAD" name="" value="0x1f" />
         <value caption="30 TAD" name="" value="0x1e" />
         <value caption="29 TAD" name="" value="0x1d" />
         <value caption="28 TAD" name="" value="0x1c" />
         <value caption="27 TAD" name="" value="0x1b" />
         <value caption="26 TAD" name="" value="0x1a" />
         <value caption="25 TAD" name="" value="0x19" />
         <value caption="24 TAD" name="" value="0x18" />
         <value caption="23 TAD" name="" value="0x17" />
         <value caption="22 TAD" name="" value="0x16" />
         <value caption="21 TAD" name="" value="0x15" />
         <value caption="20 TAD" name="" value="0x14" />
         <value caption="19 TAD" name="" value="0x13" />
         <value caption="18 TAD" name="" value="0x12" />
         <value caption="17 TAD" name="" value="0x11" />
         <value caption="16 TAD" name="" value="0x10" />
         <value caption="15 TAD" name="" value="0xf" />
         <value caption="14 TAD" name="" value="0xe" />
         <value caption="13 TAD" name="" value="0xd" />
         <value caption="12 TAD" name="" value="0xc" />
         <value caption="11 TAD" name="" value="0xb" />
         <value caption="10 TAD" name="" value="0xa" />
         <value caption="9 TAD" name="" value="0x9" />
         <value caption="8 TAD" name="" value="0x8" />
         <value caption="7 TAD" name="" value="0x7" />
         <value caption="6 TAD" name="" value="0x6" />
         <value caption="5 TAD" name="" value="0x5" />
         <value caption="4 TAD" name="" value="0x4" />
         <value caption="3 TAD" name="" value="0x3" />
         <value caption="2 TAD" name="" value="0x2" />
         <value caption="1 TAD" name="" value="0x1" />
      </value-group>
      <value-group caption="ADC Conversion Clock Source bit" name="AD1CON3__ADRC">
         <value caption="Clock derived from FRC" name="" value="0x1" />
         <value caption="Clock derived from Peripheral Bus Clock (PBCLK)" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive Input Select bits for Sample A" name="AD1CHS__CH0SA">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="Reserved" name="" value="0x1d" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="Reserved" name="" value="0x1b" />
         <value caption="Reserved" name="" value="0x1a" />
         <value caption="Reserved" name="" value="0x19" />
         <value caption="Reserved" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="Reserved" name="" value="0x14" />
         <value caption="Reserved" name="" value="0x13" />
         <value caption="Reserved" name="" value="0x12" />
         <value caption="Channel 0 positive input is VDD/2" name="VDD_DIV_2" value="0x11" />
         <value caption="Reserved" name="" value="0x10" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Channel 0 positive input is IVREF" name="IVREF" value="0xe" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="CTMUT" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample A" name="AD1CHS__CH0NA">
         <value caption="Channel 0 negative input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="VREFL" value="0x0" />
      </value-group>
      <value-group caption="Positive Input Select bits for Sample B" name="AD1CHS__CH0SB">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0x1e" />
         <value caption="Reserved" name="" value="0x1d" />
         <value caption="Reserved" name="" value="0x1c" />
         <value caption="Reserved" name="" value="0x1b" />
         <value caption="Reserved" name="" value="0x1a" />
         <value caption="Reserved" name="" value="0x19" />
         <value caption="Reserved" name="" value="0x18" />
         <value caption="Reserved" name="" value="0x17" />
         <value caption="Reserved" name="" value="0x16" />
         <value caption="Reserved" name="" value="0x15" />
         <value caption="Reserved" name="" value="0x14" />
         <value caption="Reserved" name="" value="0x13" />
         <value caption="Reserved" name="" value="0x12" />
         <value caption="Channel 0 positive input is VDD/2" name="VDD_DIV_2" value="0x11" />
         <value caption="Reserved" name="" value="0x10" />
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Channel 0 positive input is IVREF" name="IVREF" value="0xe" />
         <value caption="Channel 0 positive input is CTMU temperature sensor (CTMUT)" name="CTMUT" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample B" name="AD1CHS__CH0NB">
         <value caption="Channel 0 negative input is AN1" name="" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="" value="0x0" />
      </value-group>
      <value-group caption="AN0 Pin Scan Selection bits" name="AD1CSSL__CSSL0">
         <value caption="Select AN0 for input scan; CSSL0 = AN0" name="" value="0x1" />
         <value caption="Skip AN0 for input scan; CSSL0 = AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Pin Scan Selection bits" name="AD1CSSL__CSSL1">
         <value caption="Select AN1 for input scan; CSSL1 = AN1" name="" value="0x1" />
         <value caption="Skip AN1 for input scan; CSSL1 = AN1" name="" value="0x0" />
      </value-group>
