MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX274F256D.atdf
      <value-group caption="Parity and Data Selection bits" name="U2MODE__PDSEL">
         <value caption="9-bit data, no parity" name="" value="0x3" />
         <value caption="8-bit data, odd parity" name="" value="0x2" />
         <value caption="8-bit data, even parity" name="" value="0x1" />
         <value caption="8-bit data, no parity" name="" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U2MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U2MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U2MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U2MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U2MODE__WAKE">
         <value caption="Wake-up enabled" name="" value="0x1" />
         <value caption="Wake-up disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U2MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U2MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U2MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U2MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U2MODE__ON">
         <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx, and LATx registers; UARTx power consumption is minimal" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Overflow Condition Mode bit" name="U2MODE__RUNOVF">
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register continues to run to remain synchronized" name="" value="0x1" />
         <value caption="When an Overflow Error (OERR) condition is detected, the shift register stops accepting new data (Legacy mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Clock Selection bits" name="U2MODE__CLKSEL">
         <value caption="BRG clock is PBCLK" name="" value="0x3" />
         <value caption="BRG clock is FRC" name="" value="0x2" />
         <value caption="BRG clock is SYSCLK (turned off in Sleep mode)" name="" value="0x1" />
         <value caption="BRG clock is PBCLK (turned off in Sleep mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Running Status bit" name="U2MODE__ACTIVE">
         <value caption="UARTx module is active (UxMODE register should not be updated)" name="" value="0x1" />
         <value caption="UARTx module is not active (UxMODE register can be updated)" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Sleep Enable bit" name="U2MODE__SLPEN">
         <value caption="UARTx BRG clock runs during Sleep mode" name="" value="0x1" />
         <value caption="UARTx BRG clock is turned off during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Data Available bit (read-only)" name="U1STA__URXDA">
         <value caption="Receive buffer has data" name="" value="0x1" />
         <value caption="Receive buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit." name="U1STA__OERR">
         <value caption="Receive buffer has overflowed" name="" value="0x1" />
         <value caption="Receive buffer has not overflowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Framing Error Status bit (read-only)" name="U1STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1" />
         <value caption="Framing error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity Error Status bit (read-only)" name="U1STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1" />
         <value caption="Parity error has not been detected" name="" value="0x0" />
      </value-group>
